# GetBoxOutline Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..GetBoxOutline Method
Viewport Class See Also
---
Returns the outline of the viewport on the sheet, excluding the viewport label.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Outline GetBoxOutline()
```

Visual Basic
---
```text
Public Function GetBoxOutline As Outline
```

Visual C++
---
```text
public:
Outline^ GetBoxOutline()
```

# ### Return Value
The outline of the viewport on the sheet.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The viewport is not on a sheet. |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace